In [1]:
import pandas as pd

In [2]:
a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [6]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)
print(df.loc[0])

   calories  duration
0       420        50
1       380        40
2       390        45
calories    420
duration     50
Name: 0, dtype: int64

In [7]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [9]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18],
        'gender':['M',"F","M","F"]
       }

# Create DataFrame
df = pd.DataFrame(data,index=["A","B","C","D"])

# Print the output.
print(df)

    Name  Age gender
A    Tom   20      M
B   nick   21      F
C  krish   19      M
D   jack   18      F

In [11]:
df.loc["E"] = ["Dipak",21,"M"]
df

    Name  Age gender
A    Tom   20      M
B   nick   21      F
C  krish   19      M
D   jack   18      F
E  Dipak   21      M

In [24]:
df["DOF"] = ["11-May","22-March","12-april","21-feb","20-march"]

In [25]:
df

    Name  Age Gender       DOF
A    Tom   20      M    11-May
B   nick   21      F  22-March
C  krish   19      M  12-april
D   jack   18      F    21-feb
E  Dipak   21      M  20-march

In [26]:
df

    Name  Age Gender       DOF
A    Tom   20      M    11-May
B   nick   21      F  22-March
C  krish   19      M  12-april
D   jack   18      F    21-feb
E  Dipak   21      M  20-march

### Delete a Column

In [18]:
df.drop(["DOF"],axis=1) # DF not save

    Name  Age Gender
A    Tom   20      M
B   nick   21      F
C  krish   19      M
D   jack   18      F
E  Dipak   21      M

In [29]:
df

    Name  Age Gender
A    Tom   20      M
B   nick   21      F
C  krish   19      M
D   jack   18      F
E  Dipak   21      M

In [36]:
df["DOJ"] = ["11-May","22-March","12-april","21-feb","20-march"]
df

df = df.drop(["DOJ"],axis=1) # Method 1 to delete column from dataframe
df
# df.drop(["DOJ"],axis=1,inplace=True) # Method 2 to delete column from dataframe

    Name  Age Gender
A    Tom   20      M
B   nick   21      F
C  krish   19      M
D   jack   18      F
E  Dipak   21      M

In [35]:
df["DOJ"] = ["11-May","22-March","12-april","21-feb","20-march"]
df

df.drop(["DOJ"],axis=1,inplace=True) # Method 2 to delete column from dataframe
df

    Name  Age Gender
A    Tom   20      M
B   nick   21      F
C  krish   19      M
D   jack   18      F
E  Dipak   21      M

In [37]:
df["DOJ"] = ["11-May","22-March","12-april","21-feb","20-march"]

In [38]:
df["Name"].loc["A":"C"]

A      Tom
B     nick
C    krish
Name: Name, dtype: object

In [42]:
df[["Name","Age","DOJ"]].loc[["A","C","D"]]
df["Name"].ilocl

    Name  Age       DOJ
A    Tom   20    11-May
C  krish   19  12-april
D   jack   18    21-feb

In [45]:
df[df["Age"]>18]["Age"]

A    20
B    21
C    19
E    21
Name: Age, dtype: int64